app/controllers/formulas_controller.rb

SELECT * FROM "formulas"
---
  def index
    @formulas = Formula.all

SELECT * FROM "formulas" WHERE ("formulas"."id" = 1)
---
  def show
    @formula = Formula.find(params[:id])

SELECT * FROM "formulas" WHERE ("formulas"."id" = 1)
---
  def edit
    @formula = Formula.find(params[:id])

INSERT INTO "formulas" ("created_at", "pinyin", "commentary", "preparation", "updated_at", "english") VALUES('2010-01-19 06:23:33', 'Gui Zhi Tang', '', '', '2010-01-19 06:23:33', 'Cinnamon Twig Decoction')
---
  def create
    @formula = Formula.new(params[:formula])

    respond_to do |format|
      if @formula.save

SELECT * FROM "formulas" WHERE ("formulas"."id" = 1)
UPDATE "formulas" SET "updated_at" = '2010-01-19 07:07:08', "formula_category_id" = 1 WHERE "id" = 1
---
  def update
    @formula = Formula.find(params[:id])

    respond_to do |format|
      if @formula.update_attributes(params[:formula])