app/controllers/herbs_controller.rb

SELECT * FROM "herbs" WHERE (pinyin LIKE '%%')
---
  def index
		@herbs = Herb.find(:all, :conditions => ['pinyin LIKE ?', "%#{params[:search]}%"])

SELECT * FROM "herbs" WHERE ("herbs"."id" = 1)
---
  def show
    @herb = Herb.find(params[:id])

SELECT * FROM "herbs" WHERE ("herbs"."id" = 1)
---
  def edit
    @herb = Herb.find(params[:id])

INSERT INTO "herbs" ("created_at", "pinyin", "commentary", "contraindications", "updated_at", "english", "category_id", "latin") VALUES('2010-01-18 22:16:00', 'Gui Zhi', '', '', '2010-01-18 22:16:00', 'Cinnamon Twig', 0, 'Cinnamomi Ramulus')
---
  def create
    @herb = Herb.new(params[:herb])

    respond_to do |format|
      if @herb.save

SELECT * FROM "herbs" WHERE ("herbs"."id" = 1)
UPDATE "herbs" SET "english" = 'Fresh Ginger', "updated_at" = '2010-01-19 07:09:05', "herb_category_id" = 1, "commentary" = '', "latin" = '', "contraindications" = '' WHERE "id" = 3
---
  def update
    @herb = Herb.find(params[:id])

    respond_to do |format|
      if @herb.update_attributes(params[:herb])