app/controllers/herb_categories_controller.rb

SELECT * FROM "herb_categories" WHERE (name LIKE '%A%')
---
  def index
		@herb_categories = HerbCategory.search(:params[:term])

SELECT * FROM "herb_categories" WHERE ("herb_categories"."id" = 1)
---
  def show
    @herb_category = HerbCategory.find(params[:id])