app/controllers/pulse_qualities_controller.rb

SELECT * FROM "pulse_qualities" WHERE (name LIKE '%Sle%')
---
  def index
		@pulse_qualities = PulseQuality.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])