app/controllers/therapeutic_functions_controller.rb

SELECT * FROM "therapeutic_functions" WHERE (name LIKE '%Clears and dispels%')
---
  def index
    @tf = TherapeuticFunction.search(params[:term])