app/controllers/tongue_qualities_controller.rb

  def index
    @tongue_qualities = TongueQuality.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])
---
SELECT * FROM "tongue_qualities" WHERE (name LIKE '%Red%')